public_html/other/graph-program-transformation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Преамбула</a></li>
<li><a href="#sec-2">2. Проблемы совместимости вычислительных моделей</a></li>
<li><a href="#sec-3">3. Причины проблем совместимости</a></li>
<li><a href="#sec-4">4. Возможные пути решения</a></li>
</ul>
</div>
</div>
<p>
Прочитав [why-hypergraphs] я был удивлен и обрадован простотой и
мощностью идеи осуществлять вычисления как переписывания графа. Я
обдумывал эту мысль и пришел к нескольким идеям, которые запишу тут:
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Преамбула</h2>
<div class="outline-text-2" id="text-1">
<p>
Компьютеры, которые мы используем, по историческим причинам базируются
на фон-неймановской вычислительной модели; каждый из них можно образно
представить как многорукого Шиву в библиотеке - своими руками он
перекладывает книги и карточки ссылающиеся на них (программисты
понимают что речь идет о указателях) по полкам и ящикам.
</p>

<p>
Эта вычислительная модель берет истоки в Машине Тьюринга - формализме,
который первоначально был создан для уточнения понятия алгоритма.
</p>

<p>
Тем, не менее, это не единственная возможная вычислительная модель; я
могу привести примеры других тьюринг-эквивалентных моделей:
</p>
<ul class="org-ul">
<li>Переписывание высказываний, основанное на нормальных алгоритмах
Маркова и воплощенное в языке Рефал.
</li>
<li>Модель исчисления индуктивных конструкций, реализованная в языке Coq
</li>
<li>Модель взаимодействующих последовательных процессов (частично на ней
основан Erlang), также в том же направлении можно смотреть в сторону
пи-исчисления
</li>
<li>Исчисление предикатов - Prolog
</li>
<li>Лямбда-исчисление - типизированное и нетипизированное - ML, Haskell
</li>
</ul>
<p>
и другие
</p>
<ul class="org-ul">
<li>Клеточные автоматы
</li>
</ul>

<p>
Это не полный список, но важным является то, что практически ничего из
этого не имеет поддержки в железе на сегодняшний момент, несмотря на
то, что ранее существовали, например, Forth-процессоры и машины
компании Symbolics, которые нативно исполняли лисп-код.
</p>

<p>
Отчасти это положение дел вызвано историческими факторами, важнейший
из которых, по моему мнению, - закон Мура - больше не является
актуальным. В связи с этим, мы можем ожидать изменений, направленных
на улучшение производительности вычислений в том числе и с помощью
поиска и разработки иных, не фон-неймановских вычислительных
моделей.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Проблемы совместимости вычислительных моделей</h2>
<div class="outline-text-2" id="text-2">
<p>
Программы, написанные на конвенциональных языках программирования
уже сейчас нуждаются в распарралеливании - разработчики компиляторов
и языков программирования работают в этом направлении, но результаты
пока скромные.
</p>

<p>
Компиляторостроители пытаются выяснить по исходному тексту программы
теоретически распараллеливаемые участки кода и данных, чтобы
разделить их выполнение по независимым вычислительным юнитам и
добиться прироста производительности.
</p>

<p>
Разрабочики языков программирования (прежде всего функцональных
языков) стремятся предоставить гарантии свойств (таких как
независимость по данным, например) отдельных функций или компонентов
программы и сделать это по возможности статически - т.е. еще на
этапе преобразования программы в машинный код.
</p>

<p>
Однако в любом случае их усилия упираются в архитектуру, которая
остается фон-неймановской даже при увеличении количества ядер -
сколько бы многоруких Шив мы не посадили в библиотеку - добиться
линейного увеличений производительности не получается - Шивы
начинают конфликтовать между собой.
</p>

<p>
Попытки использования аппаратной поддержки других вычислительных
моделей наталкиваются на проблемы совместимости с унаследованным
кодом - рынок не примет новый процессор, если на нем не работают
старые программы. Поэтому крупные разрабочики железа внедряют
вычислительные модели в своих архитектурах надстраивая новые системы
команд над старым ядром, что порождает тех еще технологических
уродцев и в любом случае не дает универсального решения.
</p>

<p>
Однако в узких областях, не скованных проблемами совместимости можно
наблюдать взрывной рост производительности при отказе от старых
архитектур и переходе к примеру на ASIC - устройства,
специализированные для выполнения не фон-неймановских программ.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Причины проблем совместимости</h2>
<div class="outline-text-2" id="text-3">
<p>
Отчасти сложившаяся ситуация может быть объяснена тем, что концепции
вычислительных моделей языков программирования не помещаются в
голову специалистов по проектировнию процессорных архитектур - и то
и другое - сложные дисциплины, требующие полного погружения и
обучения в течении многих лет.
</p>

<p>
Обученный специалист, как мне кажется, вероятнее всего старше сорока
лет, является высокооплачиваемым профессионалом, главой семьи с
консервативными убеждениями и совершенно не мотивирован изучать с
нуля смежную область, т.к. такое действие расходится с идеей
процедурной рациональности. Поэтому можно предположить что такие
специалисты исключительно редки и не могут создать критическую массу
мнений для изменения парадигмы внутри своей и смежной областей.
</p>

<p>
Даже в случае появления пилотных проектов необходимой направленности
их шанс на успешную реализацию не очень высок, и любой провал (даже
по не-технологическим причинам) приводит к дискредитации идеи,
подобной тому, что теперь называется "Зимой искуственного
интеллекта".
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Возможные пути решения</h2>
<div class="outline-text-2" id="text-4">
<p>
Представим себе набор условий, которые способствовали бы решению
проблемы увеличения производительности вычислений за счет более
широкого использования альтернативных вычислительных моделей вместе
с соответствующей архитектурной поддержкой на уровне железа.
</p>

<p>
Во-первых, должен был бы не просто писать программу на известном ему
языке программирования (С++, Java) под известную ему архитектуру
(x86) - он должен был бы прямо в момент написания программы
проектировать и реализовывать эту архитектуру, причем учитывая
огромное количество ограничений технологии производства процессоров
и непрерывно проводя бизнес-анализ всего проекта в целом
</p>

<p>
Во-вторых, в ответ на изменения требований к продукту (которые
постоянно меняются) он должен иметь возможность компетентно
переходить от одной архитектуре к другой так, чтобы стоимость
преобразования уже написанного (возможно не им) кода приближалась к
нулю, в идеале была бы совсем бесплатно.
</p>

<p>
Излишне объяснять что на текущем уровне компетентности программистов
и развития средств поддержки программирования - это просто
невозможно. Мы плавно увеличиваем производительность труда
программиста за счет более мощных инструментальных средств и новых
языков, но с высоты поставленной задачи результаты этих усилий
просто не видны
</p>

<p>
Однако все меняется, если мы начинаем использовать элементы AGI как
инструментальное средство программирования и проектирования. Этот
подход кажется вполне естественным, т.к. граф выполнения программы -
это (сюрприз!) именно граф, большинство оптимизаций сводятся к его
переписыванию, и что самое интересное - мы можем взять все
программы, доступные нам в качестве исходных текстов, построить по
ним графы, и на основании всего этого массива данных автоматически
вычислить наиболее оптимальную архитектуру аппаратных средств,
учитывая ограничения (технологические и финансово-экономические)
производства.
</p>

<p>
Эта задача видится вычислительно емкой, но довольно несложной - мы
просто должны протестировать полученный пул программ на всех (или
основных) вариантах реализумых вычислительных архитектур.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
